National_bank_xml/PRISTIGAO_RTGS.XML

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>F8NwI0PbgUO7zvzEgcaSsrSi9ioD2kiw/ZNTCrRLgCwd8u2+NKHCmQR+m2ICua2PJbIM7WA/Vr69&#13;
CsH+09w7m/qSOENQy07u8vo+kH0C5s7arYgeB29f6nDUu1TBnDrtNgRGIbzD6ugVxnlJBrFsohwb&#13;
rAIReyk50vDHzHNGNuo=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>UmojI3Ct9+6Chp/VoVDL5QVmT3r104S4Q90ysJ77yu/0slgwYGgQhifybMEHwbQeOK7MKR0CX/J1&#13;
2fcoDRuA50DCIKzbarenQsXQj2HEAr+Z+4phr/G3+UUYEpjMKofL0Q8HB79KTGSkOsU0V8T3ZV6j&#13;
y3JLFSzYNJGobqfV7i3N3s9uWxBC+EkH6PrB288vSpEvYoSuzgGVdf1qmbH5rbmZdpLj20EieVdu&#13;
7kuZMWxEUSXkeYxgqK1ODfn8SB78CBIXyxM3ZH+B4IgUAiEEio4ng6YC9FxkYJ9/geTvrcvIjjzH&#13;
mTt/3PtwO0u83hl4Kr73LDkS+/CXvUuX2JZNnVM07VaDqPLGU1EfYhIUBXo0XD55XfBm+DkcZcV9&#13;
vd6i88JTvH7S2/xqCRIHSfLKv/pcY0ogxMAF7pBO7RkqP/MHmGoxjGIQrC79sDU4Vjvt4ANu6/bQ&#13;
s8pOA8/D6Ra/MxkHO5EKF0whbSbhNU3BoBfSWYMHiZUFw+VoUcLn+kXeuLXyC6sBP96/3y0dVrgt&#13;
UQ8ic2TEFcJ3nWPPpnHvfSdeW88ASqAtJIaNFadwrNRqQ3zhOxcMhaEx/MXGwfmiMSnV8ASKDKKc&#13;
ogYFxhjPwSn5WxzNv/PVHmchn5qI67cVdkZNrwHDSzMYAPYq48dJ2RgiSU5UDi41L1a4UQUcQEqP&#13;
X60FBfu/KVXfKfiw0b4gIOEJCHP0TZZGt5Q9yO3QPTbdLdXvnY+hIlTe35XFmiFTJlQy8i5hIqf+&#13;
eK2/0JcBokhVzYYCZUJBQ3eEQxwx72eEMzZk/BsXBws8r3l3VqaEqWSK06Bj5uwS+Pf/VWD+BG0u&#13;
2y8QeV/Ie3DqF9rR3ULFlKmUWjU5lJ/40+xomw31ZuRD/mxyWrzasu/LevRasuPGjTVfyOSCDe0t&#13;
RXy8/HooK4ZmClp0mpf6NzYpf0KBC6GcJfGx9sawP31EAEZhr+6JyQ6zgVsYFaxcFvrB+b8mYY36&#13;
Z4YUm8ZMNHlRfEVUeZxA4C/b/hYOq3a0T4xv90Q7Gw874K4e9r1xAvpLiHGXcZaxrfqfYVG6iGc3&#13;
F5Hhx32xME3eoqkajDY0hZdgmmsjo/SczTSbb/MIuHeGITs1WMhRdA6odNzeqAkEks24EmqiVHUK&#13;
Bk0ROS5fB6dSELtSdQyCD/bbI/msW3gFA89VYAIM6/QO4unXqC6HWI+CQASAWFgMCA5V1VN5NI95&#13;
WYQeTCQmWulwVK7nAHr7fcUi1m4BWTs5UrE0y3RHjtaLGG7DLHTv1jFa/dp8nrCuZiuwgd79oQbl&#13;
As4W0gRZiR0KFEQb0jZZd6tW3wwJyRDS2siMLcdwneLfLx1xbwGvr/HiFibKK+FeDigAP/oP3A==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>QAIOUI9EjmuIDz5nRMwNhVp2nmU=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
jcMoP62GlVc8Nuf+mE29YzwMp/xjc8U9aaMj/E7Dpt00Zr2ym81wCMY6zPJPDiBA0AxmlH2D0fAY&#13;
YwiyhYDaJ2XdxNzj4jqtKPYt5K6c40RJPb/KgNZaVTdu/yP15Sd6NU1S3iW/tCRp7uxDIYyGHOLY&#13;
0UizFRcxmzq9T5WoIq8=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>